# StairsRailingAngledConnection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRailingAngledConnection Property
ParameterTypeId Class See Also
---
"Angled Joins"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRailingAngledConnection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRailingAngledConnection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRailingAngledConnection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace